<?php


namespace Fridde;


class TextConverter
{
    protected const CONVERSION_TABLE = 'a:211:{s:2:"À";s:1:"A";s:2:"Á";s:1:"A";s:2:"Â";s:1:"A";s:2:"Ã";s:1:"A";s:2:"Ä";s:1:"A";s:2:"Å";s:1:"A";s:2:"Æ";s:2:"AE";s:2:"Ç";s:1:"C";s:2:"È";s:1:"E";s:2:"É";s:1:"E";s:2:"Ê";s:1:"E";s:2:"Ë";s:1:"E";s:2:"Ì";s:1:"I";s:2:"Í";s:1:"I";s:2:"Î";s:1:"I";s:2:"Ï";s:1:"I";s:2:"Ð";s:1:"D";s:2:"Ñ";s:1:"N";s:2:"Ò";s:1:"O";s:2:"Ó";s:1:"O";s:2:"Ô";s:1:"O";s:2:"Õ";s:1:"O";s:2:"Ö";s:1:"O";s:2:"Ø";s:1:"O";s:2:"Ù";s:1:"U";s:2:"Ú";s:1:"U";s:2:"Û";s:1:"U";s:2:"Ü";s:1:"U";s:2:"Ý";s:1:"Y";s:2:"ß";s:1:"s";s:2:"à";s:1:"a";s:2:"á";s:1:"a";s:2:"â";s:1:"a";s:2:"ã";s:1:"a";s:2:"ä";s:1:"a";s:2:"å";s:1:"a";s:2:"æ";s:2:"ae";s:2:"ç";s:1:"c";s:2:"è";s:1:"e";s:2:"é";s:1:"e";s:2:"ê";s:1:"e";s:2:"ë";s:1:"e";s:2:"ì";s:1:"i";s:2:"í";s:1:"i";s:2:"î";s:1:"i";s:2:"ï";s:1:"i";s:2:"ñ";s:1:"n";s:2:"ò";s:1:"o";s:2:"ó";s:1:"o";s:2:"ô";s:1:"o";s:2:"õ";s:1:"o";s:2:"ö";s:1:"o";s:2:"ø";s:1:"o";s:2:"ù";s:1:"u";s:2:"ú";s:1:"u";s:2:"û";s:1:"u";s:2:"ü";s:1:"u";s:2:"ý";s:1:"y";s:2:"ÿ";s:1:"y";s:2:"Ā";s:1:"A";s:2:"ā";s:1:"a";s:2:"Ă";s:1:"A";s:2:"ă";s:1:"a";s:2:"Ą";s:1:"A";s:2:"ą";s:1:"a";s:2:"Ć";s:1:"C";s:2:"ć";s:1:"c";s:2:"Ĉ";s:1:"C";s:2:"ĉ";s:1:"c";s:2:"Ċ";s:1:"C";s:2:"ċ";s:1:"c";s:2:"Č";s:1:"C";s:2:"č";s:1:"c";s:2:"Ď";s:1:"D";s:2:"ď";s:1:"d";s:2:"Đ";s:1:"D";s:2:"đ";s:1:"d";s:2:"Ē";s:1:"E";s:2:"ē";s:1:"e";s:2:"Ĕ";s:1:"E";s:2:"ĕ";s:1:"e";s:2:"Ė";s:1:"E";s:2:"ė";s:1:"e";s:2:"Ę";s:1:"E";s:2:"ę";s:1:"e";s:2:"Ě";s:1:"E";s:2:"ě";s:1:"e";s:2:"Ĝ";s:1:"G";s:2:"ĝ";s:1:"g";s:2:"Ğ";s:1:"G";s:2:"ğ";s:1:"g";s:2:"Ġ";s:1:"G";s:2:"ġ";s:1:"g";s:2:"Ģ";s:1:"G";s:2:"ģ";s:1:"g";s:2:"Ĥ";s:1:"H";s:2:"ĥ";s:1:"h";s:2:"Ħ";s:1:"H";s:2:"ħ";s:1:"h";s:2:"Ĩ";s:1:"I";s:2:"ĩ";s:1:"i";s:2:"Ī";s:1:"I";s:2:"ī";s:1:"i";s:2:"Ĭ";s:1:"I";s:2:"ĭ";s:1:"i";s:2:"Į";s:1:"I";s:2:"į";s:1:"i";s:2:"İ";s:1:"I";s:2:"ı";s:1:"i";s:2:"Ĳ";s:2:"IJ";s:2:"ĳ";s:2:"ij";s:2:"Ĵ";s:1:"J";s:2:"ĵ";s:1:"j";s:2:"Ķ";s:1:"K";s:2:"ķ";s:1:"k";s:2:"Ĺ";s:1:"L";s:2:"ĺ";s:1:"l";s:2:"Ļ";s:1:"L";s:2:"ļ";s:1:"l";s:2:"Ľ";s:1:"L";s:2:"ľ";s:1:"l";s:2:"Ŀ";s:1:"L";s:2:"ŀ";s:1:"l";s:2:"Ł";s:1:"l";s:2:"ł";s:1:"l";s:2:"Ń";s:1:"N";s:2:"ń";s:1:"n";s:2:"Ņ";s:1:"N";s:2:"ņ";s:1:"n";s:2:"Ň";s:1:"N";s:2:"ň";s:1:"n";s:2:"ŉ";s:1:"n";s:2:"Ō";s:1:"O";s:2:"ō";s:1:"o";s:2:"Ŏ";s:1:"O";s:2:"ŏ";s:1:"o";s:2:"Ő";s:1:"O";s:2:"ő";s:1:"o";s:2:"Œ";s:2:"OE";s:2:"œ";s:2:"oe";s:2:"Ŕ";s:1:"R";s:2:"ŕ";s:1:"r";s:2:"Ŗ";s:1:"R";s:2:"ŗ";s:1:"r";s:2:"Ř";s:1:"R";s:2:"ř";s:1:"r";s:2:"Ś";s:1:"S";s:2:"ś";s:1:"s";s:2:"Ŝ";s:1:"S";s:2:"ŝ";s:1:"s";s:2:"Ş";s:1:"S";s:2:"ş";s:1:"s";s:2:"Š";s:1:"S";s:2:"š";s:1:"s";s:2:"Ţ";s:1:"T";s:2:"ţ";s:1:"t";s:2:"Ť";s:1:"T";s:2:"ť";s:1:"t";s:2:"Ŧ";s:1:"T";s:2:"ŧ";s:1:"t";s:2:"Ũ";s:1:"U";s:2:"ũ";s:1:"u";s:2:"Ū";s:1:"U";s:2:"ū";s:1:"u";s:2:"Ŭ";s:1:"U";s:2:"ŭ";s:1:"u";s:2:"Ů";s:1:"U";s:2:"ů";s:1:"u";s:2:"Ű";s:1:"U";s:2:"ű";s:1:"u";s:2:"Ų";s:1:"U";s:2:"ų";s:1:"u";s:2:"Ŵ";s:1:"W";s:2:"ŵ";s:1:"w";s:2:"Ŷ";s:1:"Y";s:2:"ŷ";s:1:"y";s:2:"Ÿ";s:1:"Y";s:2:"Ź";s:1:"Z";s:2:"ź";s:1:"z";s:2:"Ż";s:1:"Z";s:2:"ż";s:1:"z";s:2:"Ž";s:1:"Z";s:2:"ž";s:1:"z";s:2:"ſ";s:1:"s";s:2:"ƒ";s:1:"f";s:2:"Ơ";s:1:"O";s:2:"ơ";s:1:"o";s:2:"Ư";s:1:"U";s:2:"ư";s:1:"u";s:2:"Ǎ";s:1:"A";s:2:"ǎ";s:1:"a";s:2:"Ǐ";s:1:"I";s:2:"ǐ";s:1:"i";s:2:"Ǒ";s:1:"O";s:2:"ǒ";s:1:"o";s:2:"Ǔ";s:1:"U";s:2:"ǔ";s:1:"u";s:2:"Ǖ";s:1:"U";s:2:"ǖ";s:1:"u";s:2:"Ǘ";s:1:"U";s:2:"ǘ";s:1:"u";s:2:"Ǚ";s:1:"U";s:2:"ǚ";s:1:"u";s:2:"Ǜ";s:1:"U";s:2:"ǜ";s:1:"u";s:2:"Ǻ";s:1:"A";s:2:"ǻ";s:1:"a";s:2:"Ǽ";s:2:"AE";s:2:"ǽ";s:2:"ae";s:2:"Ǿ";s:1:"O";s:2:"ǿ";s:1:"o";}';

    protected const NON_ALPHANUMERIC = '/[^a-zA-Z0-9]/';

    public static function convertToASCII(string $string): string
    {
        $table = self::getConversionTable();
        $search = array_keys($table);
        $replace = array_values($table);

        return str_replace($search, $replace, $string);
    }

    public static function getConversionTable(): array
    {
        return unserialize(self::CONVERSION_TABLE,['allowed_classes' => false]);
    }

    public static function replaceNonAlphaNumeric(string $string, string $replacement = '_'): string
    {
        return preg_replace(self::NON_ALPHANUMERIC, $replacement, $string);
    }


}
